#Метод .append()

arr = [1, 2, 3, 4]
arr.append(5)
print(arr)

#ПРАКТИКА: Перебрать массив, сложить все нечетные числа в нем и вывести полученное значение

arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
sum = 0
j = 0

while j < len(arr):
    if arr[j] % 2 != 0: #Провека четности
        sum+=arr[j]
    j+=1
print(f'Сумма всех нечетных чисел в массиве: {sum}')
print()

#ПРАКТИКА: Игра с угадыванием числа от 1 до 100 с 5 попытками и сообщением о том больше или меньше вводимое число

import random

secret_number = random.randint(1, 100)
attempts = 0
difficulty = 0

print('Добро пожаловать в игру "Угадай число!"')
print('----------------------------------------------------------')
print('Выберите уровень сложности (для выбора введите число с нужным Вам уровнем): ')
print('1. Легкий (15 попыток)')
print('2. Средний (10 попыток)')
print('3. Сложный (5 попыток)')
print('----------------------------------------------------------')

while difficulty not in {1, 2, 3}:
    try:
        select_difficulty = int(input('Номер выбранной сложности: '))
        difficulty = select_difficulty
    except ValueError:
        print('Вы ввели не числовое значение! Пожалуйста введите цифру с нужным Вам уровнем сложности')

if select_difficulty == 1:
    attempts = 15
    print('----------------------------------------------------------')
    print(f'Вы выбрали ЛЕГКИЙ уровень. Количество попыток: {attempts}')
    print('----------------------------------------------------------')
elif select_difficulty == 2:
    attempts = 10
    print('----------------------------------------------------------')
    print(f'Вы выбрали СРЕДНИЙ уровень. Количество попыток: {attempts}')
    print('----------------------------------------------------------')
elif select_difficulty == 3:
    attempts = 5
    print('----------------------------------------------------------')
    print(f'Вы выбрали СЛОЖНЫЙ уровень. Количество попыток: {attempts}')
    print('----------------------------------------------------------')

print()

if attempts == 15 or attempts == 10 or attempts == 5:
    while attempts > 0:
        guess_number = int(input('Введите Ваше число от 0 до 100: '))
        
        print()
        print('----------------------------------------------------------')
        print(f'Количество оставшихся попыток: {attempts-1}')
        
        if guess_number < 0 and guess_number > 100:
            print('Введите значение в диапозоне от 0 до 100')

        if guess_number > secret_number:
            print('Вводимое Вами число БОЛЬШЕ загаднного числа')
            print('----------------------------------------------------------')
            print()
            attempts-=1
        elif guess_number < secret_number:
            print('Вводимое Вами число МЕНЬШЕ загаданного числа')
            print('----------------------------------------------------------')
            print()
            attempts-=1
        elif guess_number == secret_number:
            print('Поздравляем! Вы угадали загаданное число')
            break
    else:
        print('Вы проиграли!')